record-app/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."record_id" = $1  [["record_id", 42]]
---
  def index
    @record = Record.find(params[:record_id])
    @comments = Comment.where(record_id: @record.id)