record-app/app/controllers/comments_controller.rb

  def index
    @record = Record.find(params[:record_id])
---
SELECT  "records".* FROM "records" WHERE "records"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]

  def show
    @comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."record_id" = $1  [["record_id", 42]]

  def create
    @comment = Comment.new(comment_params)
    if @comment.save
---
INSERT INTO "comments" ("body", "user_id", "record_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", ""], ["user_id", 4], ["record_id", 42], ["created_at", "2019-08-14 14:57:43.575908"], ["updated_at", "2019-08-14 14:57:43.575908"]]

  def update
    @comment = Comment.find(params[:id]).includes(:user)
    if @comment.update_attributes(comment_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "comments" SET "body" = $1, "user_id" = $2, "updated_at" = $3 WHERE "comments"."id" = $4  [["body", "Missing info...."], ["user_id", 7], ["updated_at", "2019-08-14 20:57:45.601831"], ["id", 5]]

  def destroy
    @comment = Comment.find(params[:id])
    if @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]