record-app/app/controllers/records_controller.rb

  def index
    @user = User.find(params[:user_id])
    @records = Record.where(user_id: @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT "records".* FROM "records" WHERE "records"."user_id" = $1  [["user_id", 3]]

  def show
    @user = User.find(params[:user_id])
    @record = Record.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "records".* FROM "records" WHERE "records"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def create
    @record = Record.new(record_params)
    if @record.save
---
INSERT INTO "records" ("artist", "title", "year", "record_label", "cat_num", "country", "format", "speed", "disc_condition", "sleeve_condition", "description", "img_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"

  def update
    @record = Record.find(params[:id])
    if @record.update_attributes(record_params)
---
SELECT  "records".* FROM "records" WHERE "records"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "records" SET "disc_condition" = $1, "sleeve_condition" = $2, "updated_at" = $3 WHERE "records"."id" = $4  [["disc_condition", "NM"], ["sleeve_condition", "NM"], ["updated_at", "2019-08-14 01:15:27.311696"], ["id", 42]]

  def destroy
    @record = Record.find(params[:id])
    if @record.destroy
---
SELECT  "records".* FROM "records" WHERE "records"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "records" WHERE "records"."id" = $1  [["id", 13]]