record-app/app/controllers/users_controller.rb

SELECT "records".* FROM "records" WHERE "records"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users"
---
  def index
    @users = User.all.includes(:records)

INSERT INTO "users" ("username", "email", "location", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save